# craeting an object series

In [3]:

import pandas as pd
data=[0,2,3,4,99,100,101]
seri=pd.Series(data)
print(seri)

0      0
1      2
2      3
3      4
4     99
5    100
6    101
dtype: int64

# to change index of a series

In [13]:
seri=pd.Series(data,index=['a','b','c','d','e','f','g'])
seri

a      0
b      2
c      3
d      4
e     99
f    100
g    101
dtype: int64


# Creating data frame using Pandas

In [9]:
#using list
import pandas as pd
list=[1,2,3,4,5]
df=pd.DataFrame(list)
df

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
# using Dictionary

dictionary={'fruits':['apple','mango','banana','papaya'],
           'count':[3,2,2,1]}
df=pd.DataFrame(dictionary)
df

   fruits  count
0   apple      3
1   mango      2
2  banana      2
3  papaya      1

In [12]:
# using a series 

series=pd.Series(['a','b','c'],index=[1,2,3])
df=pd.DataFrame(series)
df

   0
1  a
2  b
3  c

# data frame using Numpy

In [13]:
import numpy as np
array=np.array([['ijaz','johan','Dr.tenma'],[100,250,300]])
df=pd.DataFrame({'name':array[0],'salary':array[1]})
df

       name salary
0      ijaz    100
1     johan    250
2  Dr.tenma    300

# Merge operation b/w  2 DF

In [19]:
# creating first DF

import pandas as pd
player=['mr.x','johan','light','pain']
team=['robary','cold blood','genius','akatsuki']
anime=['unverified','monster','death note','naruto']
df = pd.DataFrame({'charecter':player,'team':team,'anime':anime})
df

  charecter        team       anime
0      mr.x      robary  unverified
1     johan  cold blood     monster
2     light      genius  death note
3      pain    akatsuki      naruto

In [21]:
# creating second DF

rating=[5,9,8,6]
player=['dr.tenma','johan','light','rein']
anime=['unverified','monster','death note','naruto']
df2=pd.DataFrame({'charecter':player,'anime':anime,'rating':rating})
df2

  charecter       anime  rating
0  dr.tenma  unverified       5
1     johan     monster       9
2     light  death note       8
3      rein      naruto       6

In [23]:
# inner merge for charecter
df.merge(df2,on='charecter',how='inner')

  charecter        team     anime_x     anime_y  rating
0     johan  cold blood     monster     monster       9
1     light      genius  death note  death note       8

In [22]:
# inner merge for anime
df.merge(df2,on='anime',how='inner')

  charecter_x        team       anime charecter_y  rating
0        mr.x      robary  unverified    dr.tenma       5
1       johan  cold blood     monster       johan       9
2       light      genius  death note       light       8
3        pain    akatsuki      naruto        rein       6

In [1]:
# left merge
df.merge(df2,on='charecter',how='left')

NameError: name 'df' is not defined